[{
  "type": "info",
  "data": {
    "name": "Morten Olsen",
    "image": "assets/me.jpg",
    "info": [{
      "name": "E-mail",
      "value": "hello@buy-me.coffee"
    },{
      "name": "Location",
      "value": "Copenhagen, DK"
    },{
      "name": "Github",
      "value": "https://github.com/morten-olsen"
    }]
}
}, {
  "type": "text",
  "data": {
    "title": "Who am I?",
    "content": "Hell bend on a conquest to take over the digital world (and the physical, should the chance arise). Am I over ambitious? Perhaps, but with a proven track record in most aspects of things which can process 1s and 0s and a mind which runs at a speed which can battle a well-trained racehorse, I believe I am equipt to undertake this voyage!"
  }
}, {
  "type": "skills",
  "data": {
    "title": "Platforms and Languages",
    "description": "Platforms and languages which I have worked with. The list is a shortened down version.",
    "skills": [{
  "title": "C\\#",
      "level": 5
    },{
      "title": "JavaScript",
      "level": 5
    },{
      "title": "NodeJS",
      "level": 5
    },{
      "title": "React Native",
      "level": 5
    },{
      "title": "HTML",
      "level": 5
    },{
      "title": "CSS",
      "level": 5
    },{
      "title": "TypeScript",
      "level": 5
    },{
      "title": "Docker",
      "level": 4
    },{
      "title": "Linux",
      "level": 4
    }]
  }
}, {
  "type": "experiences",
  "data": {
    "title": "Experiences",
    "positions": [{
      "company": {
        "name": "Sampension",
        "webpage": "https://www.sampension.dk"
      },
      "title": "Senior Frontend Developer",
      "startDate": "2018",
      "endDate": "Present",
      "description": "Sampension is a danish pension fund and my work has been to design and help to build a frontend architecture that would run natively on iOS and Android as well as on the web on both desktop and mobile devices.\n\nIt was important to ensure that the project felt at home on all platforms and that it was maintainable by a small team of developers.\n\nTo achieve this we used React Native and React Native for Web to create a unified codebase for all platforms, as well as create a component library which would deal with ensuring the best UX on all platforms."
    }, {
      "company": {
        "name": "Trendsales",
        "webpage": "https://www.trendsales.dk"
      },
      "title": "Frontend Technical Lead",
      "startDate": "2016",
      "endDate": "2018",
      "description": "In 2015 Trendsales decided to build an entirely new platform. It became my responsibility to create a modernized frontend architecture. The work began in 2016 with just me on the project and consisted of a proof of concept version containing everything from framework selection, structure, style guides build chain, continuous deployment, and an actual initial working version. The result where the platform which I was given technical ownership over and which I, along with two others, worked on expanding over the next year. The platform is currently powering _m.trendsales.dk_. The project is build using React and state management are done using Redux. In addition to the of the shelve frameworks, we also needed to develop quite a few bespoke frameworks, in order to meet demands. Among others, these were created to solve the following issues:\n\n* Introducing a new navigational paradigm\n* Create a more flexible routing mechanism\n* Be able to serve skeleton page, for page transitions while still being able to create complete server-side pages\n* Ensure project flows between multiple systems such as Github, Jira, Octopus Deploy, AppVeyor and Docker"
    },{
      "company": {
        "name": "Trendsales",
        "webpage": "https://www.trendsales.dk"
      },
      "title": "iOS and Android Developer",
      "startDate": "2012",
      "endDate": "2015",
      "description": "I became responsible for the iOS platform, which was a task that required a new app to be built from the ground up using _Xamarin_[^1]. In addition to that, a new API to support the app along with support for our larger vendors was needed which had to be build using something closely similar to _Microsoft MVC_ so that other people could join the project at a later stage.\n\n he project started in October with the initial version available to our users in late December.\n\nThis project represented my first adventure into mobile development and became an app with more than 15 million screen views and 1.5 million sessions per month.\n\n After that, I joined two other colleagues, who were working on an Android version of the app, to form a join mobile development team.\n\n Throughout the period I also worked on the backend for the web page from time to time.\n\n [^1]: Called MonoTouch at the time"
    },{
      "company": {
        "name": "Trendsales",
        "webpage": "https://www.trendsales.dk"
      },
      "title": "Web Developer",
      "startDate": "2012",
      "endDate": "2012",
      "description": "I got a part-time job at Trendsales, where my primary responsibility was maintaining the API which powered the iOS app. Quickly my tasks became more diverse, and I ended using about 25-50% of my time on the API, while the remaining was spend doing work on the platform in general."
    },{
      "company": {
        "name": "BilZonen",
        "webpage": "http://www.bilzonen.dk"
      },
      "title": "Web Developer",
      "startDate": "2010",
      "endDate": "2012",
      "description": "I work as a part-time web developer on bilzonen.dk. I have worked with both day-to-day maintenance and large scale projects (new search module, integration of new data catalog, mobile site, new-car-catalog and the entire dealer solution). The page is an Umbraco solution, with all .NET (C#) code. I have introduced a new custom build provider-model system, which allows data-providers to move data between data stores, external services, and the site. (search, caching and external car date is running through the provider system). Also, i have set up the development environment, from setting up virtual server hosts to building custom tool for building and unit testing."
    },{
      "company": {
        "name": "Haastrup IT"
      },
      "title": "Web Developer",
      "startDate": "2009",
      "endDate": "2010",
      "description": " I have worked as a part time project koordinator and systems developer, sitting with responsibility for a wide variety of projects including projects for \"Københavns Kommune\" (Navision reporting software) and \"Syddanmarks kommune\" (Electronic application processing system). Most projects were made in C#, but also PHP, VB, ActionScript. In addtion to that i maintained the in-house hosting setup.  "
    },{
      "company": {
        "name": "Sydbank"
      },
      "title": "IT Hotline",
      "startDate": "2007",
      "endDate": "2009",
      "description": " I work as a part-time supporter of customers (private and business) and staff, on Sydbanks different electronic banking systems. Mostly telephonic bug finding and PC setup."
    }]
  }
}, {
  "type": "skills",
  "data": {
    "title": "Frameworks",
    "description": "This list of frameworks is a curated list of frameworks I have been using recently and therefore are all amongst frameworks which I prefer to work with.",
    "skills": [{
      "title": "React",
      "level": "5"
    },{
      "title": "Redux",
      "level": "5"
    },{
      "title": "Webpack",
      "level": "5"
    },{
      "title": "RxJS",
      "level": "3"
    },{
      "title": "RxDB",
      "level": "5"
    },{
      "title": "Styled-Components",
      "level": "5"
    },{
      "title": "GraphQL",
      "level": "3"
    },{
      "title": "Babel",
      "level": "5"
    }]
  }
}, {
  "type": "projects",
  "data": {
    "title": "Projects of interest",
    "description": "A list of projects I have worked with or am working on, for which the source is publicly available. Keep in mind that some of these projects are in early stages, and some are merely created for the training, and may not represent the actual way I think production code should be structured",
    "projects": [{
      "name": "Clash of Robots",
      "tagline": "AI vs AI game enginge and IDE",
      "url": "github.com/clash-of-robots/core",
      "description": "A game engine for creating AI vs. AI turn-based games, including an IDE (still work in progress). The project is built to be the base for a space drone vs. space drone AI game. Players are given control over a set of drones and have to traverse the solar system, fighting to prosper as selles bots, pirate bots, communication relays or whatever the player decides to do within the confines of the sandbox."
    }, {
      "name": "Curriculum Vitae",
      "tagline": "Automated CV building",
      "url": "github.com/morten-olsen/curriculum-vitae",
      "description": " Another small fun project is this resume, as it is created in \\LaTeX, versioned using _Git_ on _Github_ and set to automatically build and create multiple release versions using _Travis CI_ and _Docker "
    }, {
      "name": "LifeFlow Mind",
      "tagline": "Evernote meets \\LaTeX meets Jupyter",
      "url": "github.com/lifeflow-mind",
      "description": "I love Evernote simple digital note storages, but as a developer and general nerd, its features often come up short. Which is why I am working on a project named Mind, which attempts to bridge the best aspect of Evernote, with a dynamic view system, so new views (for instance a calendar or a contact view) can be introduced. Also, it can render mathematical formulas using \\LaTeX and execute code snippets, to test and present code directly inside documents. A somewhat working demo can be found at https://morten-olsen.github.io/mind"
    }, {
      "name": "Redux App State",
      "tagline": "Advanced app like navigation on the web",
      "url": "github.com/trendsales/redux-app-state",
      "description": " One of the most significant issues I had to overcome when I began building the revamped Trendsales front end was that the design called for an advanced navigation strategy, which did not fit into the webs linear document structure, but rather a branched multi-layer navigation. Therefore I created this project to create a high-level abstraction using a navigation trap to allow for much more advanced navigation patterns"
    }, {
      "name": "Clubhouse Protocol",
      "tagline": "An OpenPGP based crypto group communication with decentralised rule management for both humans and machines",
      "url": "github.com/clubhouse-protocol",
      "description": " A cryptographic communication platform where all messages are end-to-end encrypted. It uses a decentralized rule set, so every message is verified and applied by the clients individually "
    }, {
      "name": "wolfsquad.co",
      "tagline": "A fun experiment with encryption",
      "url": "github.com/morten-olsen/wolfsquad",
      "description": " This is an old project I did to play around with encryption in JavaScript. The initial boot loader is served as regular JavaScript, but after login, all communication has a level of encryption applied based upon the password, which is never sent to the server, as its encryption abilities offer this feature, without having to transfer sensitive information. It is currently available at https://wolfsquad.co/ with the username _admin_ and the password _password_"
    }]
  }
}]
